<template>
    <div id="about" class="container mx-auto px-5 pt-10">
        <h2 class="text-center text-5xl sm:text-left">Обо мне</h2>
        <div class="my-20 grid grid-cols-1 xl:my-32 xl:grid-cols-2">
            <div class="space-y-12">
                <div>
                    <h3 class="text-3xl font-bold">Дмитрий Лисовский</h3>
                    <p class="text-2xl">{{ useGetAge() }}</p>
                </div>
                <div>
                    <NuxtLink class="button" to="/cv">
                        Посмотреть мое резюме
                    </NuxtLink>
                </div>
                <p class="text-justify sm:text-left">
                    В настоящее время являюсь
                    <span class="font-bold">Fullstack-разработчиком</span>
                    в компании
                    <a class="hypertext" href="https://myrtex.ru/" rel="noopener" target="_blank">
                        Myrtex
                    </a>
                </p>
                <p class="text-justify sm:text-left">
                    Окончил
                    <a class="hypertext" href="https://www.mirea.ru/education/college/about-college/" rel="noopener"
                        target="_blank">
                        Колледж программирования и информационных технологий
                    </a>
                </p>
                <p>Занимаюсь программированием с 11-ти лет, начав путь с создания модов на Minecraft. Так увлекся кодом,
                    что изучал множество различных технологий, потрогал разные сферы, а остановился на веб-разработке.
                    Во время обучения в колледже почти все работы выполнял на Python, а первым коммерческим языком стал
                    PHP. Также достаточно давно для небольших проектов люблю использовать NodeJS, использую его для
                    совершенно различных целей, включая дипломный проект во время учебы.</p>
                <div class="flex justify-center gap-10 sm:justify-start">
                    <a href="https://t.me/ya0nkey" rel="noopener" target="_blank">
                        <svg class="h-10 w-10 fill-white transition duration-200 ease-in-out hover:fill-blue-300"
                            viewBox="0 0 54 54">
                            <path
                                d="M 32 10 C 19.85 10 10 19.85 10 32 C 10 44.15 19.85 54 32 54 C 44.15 54 54 44.15 54 32 C 54 19.85 44.15 10 32 10 z M 32 14 C 41.941 14 50 22.059 50 32 C 50 41.941 41.941 50 32 50 C 22.059 50 14 41.941 14 32 C 14 22.059 22.059 14 32 14 z M 41.041016 23.337891 C 40.533078 23.279297 39.894891 23.418531 39.181641 23.675781 C 37.878641 24.145781 21.223719 31.217953 20.261719 31.626953 C 19.350719 32.014953 18.487328 32.437828 18.486328 33.048828 C 18.486328 33.478828 18.741312 33.721656 19.445312 33.972656 C 20.177313 34.234656 22.023281 34.79275 23.113281 35.09375 C 24.163281 35.38275 25.357344 35.130844 26.027344 34.714844 C 26.736344 34.273844 34.928625 28.7925 35.515625 28.3125 C 36.102625 27.8325 36.571797 28.448688 36.091797 28.929688 C 35.611797 29.410688 29.988094 34.865094 29.246094 35.621094 C 28.346094 36.539094 28.985844 37.490094 29.589844 37.871094 C 30.278844 38.306094 35.239328 41.632016 35.986328 42.166016 C 36.733328 42.700016 37.489594 42.941406 38.183594 42.941406 C 38.877594 42.941406 39.242891 42.026797 39.587891 40.966797 C 39.992891 39.725797 41.890047 27.352062 42.123047 24.914062 C 42.194047 24.175062 41.960906 23.683844 41.503906 23.464844 C 41.365656 23.398594 41.210328 23.357422 41.041016 23.337891 z">
                            </path>


                        </svg>
                    </a>
                    <a href="https://github.com/yaonkey" rel="noopener" target="_blank">
                        <svg class="h-10 w-10 fill-white transition duration-200 ease-in-out hover:fill-blue-300"
                            viewBox="0 0 65 65">
                            <path
                                d="M36,12c13.255,0,24,10.745,24,24c0,10.656-6.948,19.685-16.559,22.818c0.003-0.009,0.007-0.022,0.007-0.022	s-1.62-0.759-1.586-2.114c0.038-1.491,0-4.971,0-6.248c0-2.193-1.388-3.747-1.388-3.747s10.884,0.122,10.884-11.491	c0-4.481-2.342-6.812-2.342-6.812s1.23-4.784-0.426-6.812c-1.856-0.2-5.18,1.774-6.6,2.697c0,0-2.25-0.922-5.991-0.922	c-3.742,0-5.991,0.922-5.991,0.922c-1.419-0.922-4.744-2.897-6.6-2.697c-1.656,2.029-0.426,6.812-0.426,6.812	s-2.342,2.332-2.342,6.812c0,11.613,10.884,11.491,10.884,11.491s-1.097,1.239-1.336,3.061c-0.76,0.258-1.877,0.576-2.78,0.576	c-2.362,0-4.159-2.296-4.817-3.358c-0.649-1.048-1.98-1.927-3.221-1.927c-0.817,0-1.216,0.409-1.216,0.876s1.146,0.793,1.902,1.659	c1.594,1.826,1.565,5.933,7.245,5.933c0.617,0,1.876-0.152,2.823-0.279c-0.006,1.293-0.007,2.657,0.013,3.454	c0.034,1.355-1.586,2.114-1.586,2.114s0.004,0.013,0.007,0.022C18.948,55.685,12,46.656,12,36C12,22.745,22.745,12,36,12z">
                            </path>
                        </svg>
                    </a>
                </div>
            </div>
            <div class="hidden h-full flex-col items-end justify-center xl:flex">
                <img src="~/assets/img/icon.png" alt="Логотип" />
            </div>
        </div>
    </div>
</template>
